FtpClient/Control/Trans.Transform.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ftp="urn:ftp">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ftp:Transform>
   <flist>
    <id>0</id>
    <status>0</status>
    <path></path>
    <item>
     <id>0</id>
     <status>0</status>
     <name></name>
    </item>
   </flist>
   <position>
    <path></path>
    <ip></ip>
    <user></user>
    <pwd></pwd>
    <port>0</port>
   </position>
  </ftp:Transform>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
